# Parameters
nc: 80

scale:
  n

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone (加入 CoordAtt)
# =========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostConv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]         # 1 - P2/4

  - [-1, 1, ShuffleV2Block, [256, 3, 2]]    # 2 - P3/8
  - [-1, 1, CoordAtt, [8]]                  # 3 - P3_CA

  - [-1, 1, ShuffleV2Block, [512, 3, 2]]    # 4 - P4/16
  - [-1, 1, CoordAtt, [8]]                  # 5 - P4_CA

  - [-1, 1, ShuffleV2Block, [1024, 3, 2]]   # 6 - P5/32
  - [-1, 1, CoordAtt, [8]]                  # 7 - P5_CA

  - [-1, 1, ShuffleV2Block, [1024, 3, 1]]   # 8
  - [-1, 1, SPPF, [1024, 5]]                # 9
  - [-1, 2, C2PSA, [1024]]                  # 10 (P5 最终语义)

# =========================
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 (P5 -> P4)
  - [[-1, 5], 1, Concat, [1]]                    # 12 (cat P4_CA, 通道翻倍)
  - [-1, 1, GhostConv, [512, 1, 1]]              # 13 (通道调整，将 concat 后的通道降回 512)
  - [-1, 2, ShuffleV2Block, [512, 3, 1]]         # 14 (特征提取)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15 (P4 -> P3)
  - [[-1, 3], 1, Concat, [1]]                    # 16 (cat P3_CA)
  - [-1, 1, GhostConv, [256, 1, 1]]              # 17 (通道调整)
  - [-1, 2, ShuffleV2Block, [256, 3, 1]]         # 18 ← P3 检测头输入

  - [-1, 1, GhostConv, [256, 3, 2]]              # 19 (下采样)
  - [[-1, 14], 1, Concat, [1]]                   # 20 (与第14层融合)
  - [-1, 1, GhostConv, [512, 1, 1]]              # 21 (通道调整)
  - [-1, 2, ShuffleV2Block, [512, 3, 1]]         # 22 ← P4 检测头输入

  - [-1, 1, GhostConv, [512, 3, 2]]              # 23 (下采样)
  - [[-1, 10], 1, Concat, [1]]                   # 24 (与 P5 最终语义融合)
  - [-1, 1, GhostConv, [1024, 1, 1]]             # 25 (通道调整)
  - [-1, 2, ShuffleV2Block, [1024, 3, 1]]        # 26 ← P5 检测头输入

  - [[18, 22, 26], 1, Detect, [nc]]              # 27 (Detect)
