# Parameters
nc: 80

scale:
  n

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone (加入 CoordAtt)
# =========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostConv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]         # 1 - P2/4

  - [-1, 1, ShuffleV2Block, [256, 3, 2]]    # 2 - P3/8
  - [-1, 1, CoordAtt, [8]]                  # 3 - P3_CA

  - [-1, 1, ShuffleV2Block, [512, 3, 2]]    # 4 - P4/16
  - [-1, 1, CoordAtt, [8]]                  # 5 - P4_CA

  - [-1, 1, ShuffleV2Block, [1024, 3, 2]]   # 6 - P5/32
  - [-1, 1, CoordAtt, [8]]                  # 7 - P5_CA

  - [-1, 1, ShuffleV2Block, [1024, 3, 1]]   # 8
  - [-1, 1, SPPF, [1024, 5]]                # 9
  - [-1, 2, C2PSA, [1024]]                  # 10 (P5 最终语义)

# =========================
# Head (保持你原 EMA/DEMA/PEMA 逻辑)
# =========================
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 5], 1, Concat, [1]]                    # 12 (cat P4_CA)
  - [-1, 2, C3k2, [512, False]]             # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 3], 1, Concat, [1]]                    # 15 (cat P3_CA)
  - [-1, 2, C3k2, [256, False]]             # 16  ← P3 Detect

  - [-1, 1, GhostConv, [256, 3, 2]]              # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18
  - [-1, 2, C3k2, [512, False]]             # 19  ← P4 Detect

  - [-1, 1, GhostConv, [512, 3, 2]]              # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21 (cat P5 PSA)
  - [-1, 2, C3k2, [1024, True]]             # 22  ← P5 Detect

  - [[16, 19, 22], 1, Detect, [nc]]              # 23
