# =========================
# Parameters
# =========================
nc: 80  # number of classes

scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone
# =========================
backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]                    # 0 ─ P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1 ─ P2/4
  - [-1, 2, RepGVA_ELAN, [256, 3, 1, 5]]          # 2 ─ stage2 (k=5)

  - [-1, 1, Conv, [256, 3, 2]]                   # 3 ─ P3/8
  - [-1, 2, RepGVA_ELAN, [512, 3, 1, 7]]          # 4 ─ stage3 (k=7)

  - [-1, 1, Conv, [512, 3, 2]]                   # 5 ─ P4/16
  - [-1, 4, RepGVA_ELAN, [512, 3, 1, 9]]          # 6 ─ stage4 (k=9)

  - [-1, 1, Conv, [1024, 3, 2]]                  # 7 ─ P5/32
  - [-1, 4, RepGVA_ELAN, [1024, 3, 1, 11]]        # 8 ─ stage5 (k=11)

  - [-1, 1, SPPF, [1024, 5]]                     # 9 ─ SPPF
  - [-1, 2, C2PSA, [1024]]                       # 10 ─ C2PSA

# =========================
# Head (BiFPN)
# =========================
head:
  # ---- Neck Input Adapters ----
  - [2, 1, Conv, [512, 1, 1]]                     # 11 ─ P2_in
  - [4, 1, Conv, [512, 1, 1]]                     # 12 ─ P3_in
  - [6, 1, Conv, [512, 1, 1]]                     # 13 ─ P4_in
  - [10, 1, Conv, [512, 1, 1]]                    # 14 ─ P5_in

  # ---- branch3 : P5 ↔ P4 ----
  - [13, 1, AVG, []]                              # 15 ─ P4 ↓
  - [[15, 14], 1, BiFPN_SumX, [2]]                # 16
  - [-1, 1, RepGVA_ELAN, [512, 3, 1, 7]]           # 17 ─ branch3 (k=7)

  # ---- branch2 : P3 / P4 / P5 ----
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]    # 18
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]    # 19
  - [12, 1, AVG, []]                              # 20
  - [[20, 13, 19, 18], 1, BiFPN_SumX, [4]]        # 21
  - [-1, 1, RepGVA_ELAN, [512, 3, 1, 7]]           # 22 ─ branch2 (k=7)

  # ---- branch1 : P2 / P3 / P4 ----
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]    # 23
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]    # 24
  - [11, 1, AVG, []]                              # 25
  - [[25, 12, 24, 23], 1, BiFPN_SumX, [4]]        # 26
  - [-1, 1, RepGVA_ELAN, [512, 3, 1, 5]]           # 27 ─ branch1 (k=5)

  # ---- Detect Heads ----
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]    # 28
  - [[27, 28], 1, BiFPN_SumX, [2]]                # 29
  - [-1, 4, RepGVA_ELAN, [512, 3, 1, 9]]           # 30 ─ P3 head (k=9)

  - [30, 1, AVG, []]                              # 31
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]    # 32
  - [[31, 22, 32], 1, BiFPN_SumX, [3]]            # 33
  - [-1, 4, RepGVA_ELAN, [512, 3, 1, 9]]           # 34 ─ P4 head (k=9)

  - [34, 1, AVG, []]                              # 35
  - [[35, 17], 1, BiFPN_SumX, [2]]                # 36
  - [-1, 4, RepGVA_ELAN, [512, 3, 1, 11]]          # 37 ─ P5 head (k=11)

  - [[30, 34, 37], 1, Detect, [nc]]               # 38 ─ Detect(P3,P4,P5)
