# =====================================================
# Parameters
# =====================================================
nc: 80  # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.75, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =====================================================
# Backbone (基准结构不变，C3k2 → RepGMS)
# =====================================================
backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]                    # 0 - P1 / 2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1 - P2 / 4
  - [-1, 2, RepGMS, [256, 3, 1, 2, 5]]           # 2 - P2 RepGMS (k=5)

  - [-1, 1, Conv, [256, 3, 2]]                   # 3 - P3 / 8
  - [-1, 2, RepGMS, [512, 3, 1, 2, 7]]           # 4 - P3 RepGMS (k=7)

  - [-1, 1, Conv, [512, 3, 2]]                   # 5 - P4 / 16
  - [-1, 4, RepGMS, [512, 3, 1, 2, 9]]           # 6 - P4 RepGMS (k=9)

  - [-1, 1, Conv, [1024, 3, 2]]                  # 7 - P5 / 32
  - [-1, 4, RepGMS, [1024, 3, 1, 2, 11]]         # 8 - P5 RepGMS (k=11)

  - [-1, 1, SPPF, [1024, 5]]                     # 9 - SPPF
  - [-1, 2, C2PSA, [1024]]                       # 10 - C2PSA

# =====================================================
# Head / Neck (BiFPN_SumX，拓扑完全对齐基准)
# =====================================================
head:
  # ---------- Input Adapters ----------
  - [2, 1, Conv, [512, 1, 1]]                    # 11 - P2_in
  - [4, 1, Conv, [512, 1, 1]]                    # 12 - P3_in
  - [6, 1, Conv, [512, 1, 1]]                    # 13 - P4_in
  - [10, 1, Conv, [512, 1, 1]]                   # 14 - P5_in

  # ---------- branch3 : P5 ↔ P4 ----------
  - [13, 1, AVG, []]                             # 15 - P4 ↓
  - [[15, 14], 1, BiFPN_SumX, [2]]               # 16 - P4/P5 fuse
  - [-1, 1, RepGMS, [512, 3, 1, 2, 9]]           # 17 - branch3 (k=9)

  # ---------- branch2 : P3 / P4 / P5 ----------
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]   # 18 - P4 → P3
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]   # 19 - P5 → P4
  - [12, 1, AVG, []]                             # 20 - P3 ↓
  - [[20, 13, 19, 18], 1, BiFPN_SumX, [4]]       # 21 - P3/P4/P5 fuse
  - [-1, 1, RepGMS, [512, 3, 1, 2, 7]]           # 22 - branch2 (k=7)

  # ---------- branch1 : P2 / P3 / P4 ----------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]   # 23 - P3 → P2
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]   # 24 - P4 → P3
  - [11, 1, AVG, []]                             # 25 - P2 ↓
  - [[25, 12, 24, 23], 1, BiFPN_SumX, [4]]       # 26 - P2/P3/P4 fuse
  - [-1, 1, RepGMS, [512, 3, 1, 2, 5]]           # 27 - branch1 (k=5)

  # ---------- Detect Head : P3 ----------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]   # 28 - P4 → P3
  - [[27, 28], 1, BiFPN_SumX, [2]]               # 29 - P3 fuse
  - [-1, 4, RepGMS, [512, 3, 1, 2, 7]]           # 30 - P3 head (k=7)

  # ---------- Detect Head : P4 ----------
  - [30, 1, AVG, []]                             # 31 - P3 ↓
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]   # 32 - P5 → P4
  - [[31, 22, 32], 1, BiFPN_SumX, [3]]           # 33 - P4 fuse
  - [-1, 4, RepGMS, [512, 3, 1, 2, 9]]           # 34 - P4 head (k=9)

  # ---------- Detect Head : P5 ----------
  - [34, 1, AVG, []]                             # 35 - P4 ↓
  - [[35, 17], 1, BiFPN_SumX, [2]]               # 36 - P5 fuse
  - [-1, 4, RepGMS, [512, 3, 1, 2, 11]]          # 37 - P5 head (k=11)

  # ---------- Detect ----------
  - [[30, 34, 37], 1, Detect, [nc]]              # 38 - Detect(P3, P4, P5)
