nc: 80  # number of classes
scale:
  n:
    scales:  # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
      # [depth, width, max_channels]
      n: [0.50, 0.25, 1024]  # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
      s: [0.50, 0.50, 1024]  # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
      m: [0.50, 1.00, 512]  # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
      l: [1.00, 1.00, 512]  # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
      x: [1.00, 1.50, 512]  # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2, out_ch: 64
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4, out_ch: 128
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2, out_ch: 256
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8, out_ch: 256
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4, out_ch: 512
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16, out_ch: 512
  - [-1, 2, C3k2, [512, True]]  # 6, out_ch: 512
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32, out_ch: 1024
  - [-1, 2, C3k2, [1024, True]]  # 8, out_ch: 1024
  - [-1, 1, SPPF, [1024, 5]]  # 9, out_ch: 1024
  - [-1, 2, C2PSA, [1024]]  # 10, out_ch: 1024

head:
  # 关键对应：
  # backbone 2 → P2, out_ch: 256
  # backbone 4 → P3, out_ch: 512
  # backbone 6 → P4, out_ch: 512
  # backbone 10 → P5, out_ch: 1024
  - [6, 1, AVG, []]  # 11 P4 下采样, out_ch: 512
  - [[-1, 10], 1, Concat, [1]]  # 12 P4下采样 + P5, out_ch: 1536
  - [-1, 1, C3k2, [512, True]]  # 13 branch3 C3k2 (大感受野分支，深层用True), out_ch: 512
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14, out_ch: 512
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]  # 15 P5 上采样, out_ch: 1024
  - [4, 1, AVG, []]  # 16 P3 下采样, out_ch: 512
  - [[-1, 6, -2, -3], 1, Concat, [1]]  # 17 融合, out_ch: 2560
  - [-1, 1, C3k2, [384, True]]  # 18 branch2 C3k2 (中感受野分支), out_ch: 384
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 19, out_ch: 384
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]  # 20 P4 上采样, out_ch: 512
  - [2, 1, AVG, []]  # 21 P2 下采样, out_ch: 256
  - [[-1, 4, -2, -3], 1, Concat, [1]]  # 22 融合, out_ch: 1664
  - [-1, 1, C3k2, [384, False, 0.25]]  # 23 branch1 C3k2 (小感受野分支，浅层用False 0.25), out_ch: 384
  # 后续跨尺度增强
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]  # 24 branch2 上采样, out_ch: 384
  - [[-1, -2], 1, Concat, [1]]  # 25 branch1 + 上采样 branch2, out_ch: 768
  - [-1, 1, C3k2, [384, False, 0.25]]  # 26 Detect head 1 C3k2 (浅), out_ch: 384
  - [-1, 1, Conv, [384, 3, 2]]  # 27 下采样（C3k2默认stride=1，故恢复为Conv）, out_ch: 384
  - [23, 1, AVG, []]  # 28 branch1 下采样, out_ch: 384
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]  # 29 branch3 上采样, out_ch: 512
  - [[-2, -1, 18, -3], 1, Concat, [1]]  # 30 融合, out_ch: 1664
  - [-1, 1, C3k2, [384, True]]  # 31 Detect head 2 C3k2 (中), out_ch: 384
  - [-1, 1, Conv, [384, 3, 2]]  # 32 下采样（恢复为Conv）, out_ch: 384
  - [18, 1, AVG, []]  # 33 branch2 下采样, out_ch: 384
  - [[-2, -1, 13], 1, Concat, [1]]  # 34 融合, out_ch: 1280
  - [-1, 1, C3k2, [512, True]]  # 35 Detect head 3 C3k2 (深), out_ch: 512
  - [[26, 31, 35], 1, Detect, [nc]]  # 最终检测头