# Parameters
nc: 80 # number of
scale:
  n
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] #6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # ==================================================
  # Neck Input Adapters (Backbone → Neck, 统一 512)
  # ==================================================
  - [2,  1, Conv, [512, 1, 1]]    # 11  P2_in
  - [4,  1, Conv, [512, 1, 1]]    # 12  P3_in
  - [6,  1, Conv, [512, 1, 1]]    # 13  P4_in
  - [10, 1, Conv, [512, 1, 1]]    # 14  P5_in

  # ==================================================
  # branch3 : P5 ↔ P4
  # ==================================================
  - [13, 1, AVG, []]                         # 15  P4 ↓
  - [[15, 14], 1, BiFPN_SumN, [2]]           # 16  BiFPN(P4↓, P5)
  - [-1, 1, C3k2, [512, False, 0.25]]        # 17  branch3 (替换 RepHMS 为 C3k2)

  # ==================================================
  # branch2 : P3 / P4 / P5
  # ==================================================
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]  # 18 branch3 ↑
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]  # 19 P5 ↑
  - [12, 1, AVG, []]                            # 20 P3 ↓
  - [[20, 13, 19, 18], 1, BiFPN_SumN, [4]]     # 21 BiFPN
  - [-1, 1, C3k2, [512, False, 0.25]]          # 22 branch2 (替换 RepHMS 为 C3k2)

  # ==================================================
  # branch1 : P2 / P3 / P4
  # ==================================================
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]  # 23 branch2 ↑
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]  # 24 P4 ↑
  - [11, 1, AVG, []]                            # 25 P2 ↓
  - [[25, 12, 24, 23], 1, BiFPN_SumN, [4]]     # 26 BiFPN
  - [-1, 1, C3k2, [512, False, 0.25]]          # 27 branch1 (替换 RepHMS 为 C3k2)

  # ---------- Detect Heads ----------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]  # 28
  - [[27, 28], 1, BiFPN_SumN, [2]]             # 29
  - [-1, 1, C3k2, [512, False, 0.25]]          # 30  P3 (替换 RepHMS 为 C3k2)

  - [30, 1, AVG, []]                            # 31  P3 ↓（替代 Conv stride=2）
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]  # 32
  - [[31, 22, 32], 1, BiFPN_SumN, [3]]         # 33
  - [-1, 1, C3k2, [512, False, 0.25]]          # 34  P4 (替换 RepHMS 为 C3k2)

  - [34, 1, AVG, []]                            # 35  P4 ↓（替代 Conv stride=2）
  - [[35, 17], 1, BiFPN_SumN, [2]]             # 36
  - [-1, 1, C3k2, [512, False, 0.25]]          # 37  P5 (替换 RepHMS 为 C3k2)

  - [[30, 34, 37], 1, Detect, [nc]]

