# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_UniRepLK, [256, False, 0.25,7]] # 2-P3/8 (浅层保持轻量，保高频率几何特征)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_UniRepLK, [512, False, 0.25, 7]] # 4-P4/16 (中深层开始接入 7x7 大核)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 6-P4/16 (语义加强层)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_UniRepLK, [1024, True, 0.5, 7]] # 8-P5/32 (顶层使用 9x9 大核捕获全局信息)
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # Neck Input Adapters (统一 512)
  - [2, 1, Conv, [512, 1, 1]] # 11 P2_in
  - [4, 1, Conv, [512, 1, 1]] # 12 P3_in
  - [6, 1, Conv, [512, 1, 1]] # 13 P4_in
  - [10, 1, Conv, [512, 1, 1]] # 14 P5_in

  # branch3 : P5 ↔ P4
  - [13, 1, AVG, []] # 15 P4 ↓
  - [[15, 14], 1, BiFPN_SumX, [2]] # 16
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 6-P4/16 (语义加强层)

  # branch2 : P3 / P4 / P5
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [14, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [12, 1, AVG, []] # 20
  - [[20, 13, 19, 18], 1, BiFPN_SumX, [4]] # 21
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 6-P4/16 (语义加强层)

  # branch1 : P2 / P3 / P4
  - [22, 1, nn.Upsample, [None, 2, "nearest"]] # 23
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [11, 1, AVG, []] # 25
  - [[25, 12, 24, 23], 1, BiFPN_SumX, [4]] # 26
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 6-P4/16 (语义加强层)

  # Detect Heads (预测前精炼：这是精度提升的关键)
  - [22, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[27, 28], 1, BiFPN_SumX, [2]] # 29
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 30 P3预测前精炼

  - [30, 1, AVG, []] # 31
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 32
  - [[31, 22, 32], 1, BiFPN_SumX, [3]] # 33
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 34 P4预测前精炼

  - [34, 1, AVG, []] # 35
  - [[35, 17], 1, BiFPN_SumX, [2]] # 36
  - [-1, 2, C3k2_UniRepLK, [512, True, 0.5, 7]] # 37 P5预测前精炼

  - [[30, 34, 37], 1, Detect, [nc]]