# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11_SuperUniRepLK_CA backbone（已全部升级为 C3k2_SuperUniRepLK_CA + CA坐标注意力）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_SuperUniRepLK_CA, [256, 0.25, 5, 1, False]] # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_SuperUniRepLK_CA, [512, 0.25, 7, 1, False]] # 4-P4/16
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_SuperUniRepLK_CA, [512, 0.5, 7, 1, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_SuperUniRepLK_CA, [1024, 0.5, 9, 1, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11_SuperUniRepLK_CA head（已全部升级为 C3k2_SuperUniRepLK_CA + CA坐标注意力）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2_SuperUniRepLK_CA, [512, 0.5, 7, 1, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2_SuperUniRepLK_CA, [256, 0.5, 5, 1, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2_SuperUniRepLK_CA, [512, 0.5, 7, 1, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2_SuperUniRepLK_CA, [1024, 0.5, 9, 1, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)