# YOLO11-DenseGLK Config
nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4

  # 在浅层特征图较大时，我们降低 repeats (n)，避免显存爆炸
  - [-1, 1, C3k2_DenseGLK, [256, False, 0.25, 7]] # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]] # 3

  # 中层采用 7x7 大核提取上下文
  - [-1, 1, C3k2_DenseGLK, [512, False, 0.25, 7]] # 4-P4/16
  - [-1, 1, Conv, [512, 3, 2]] # 5

  # 深层特征图较小，增加 repeats，启用 True (代表模块内嵌套 C3k 结构)
  - [-1, 2, C3k2_DenseGLK, [512, True, 0.5, 7]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32

  - [-1, 2, C3k2_DenseGLK, [1024, True, 0.5, 7]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, C3k2_DenseGLK, [512, False, 0.5, 7]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, C3k2_DenseGLK, [256, False, 0.5, 7]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 1, C3k2_DenseGLK, [512, False, 0.5, 7]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2_DenseGLK, [1024, True, 0.5, 7]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)