# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  # P3 层：使用 k=5
  - [-1, 2, C3k2_DBSGLK, [256, False, 0.25, 1, True, 7]] # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]] # 3
  # P4 层：使用 k=7
  - [-1, 2, C3k2_DBSGLK, [512, False, 0.25, 1, True, 9]] # 4-P4/16
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 2, C3k2_DBSGLK, [512, True, 0.5, 1, True, 9]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  # P5 层：使用 k=9 (甚至可以尝试 11)
  - [-1, 2, C3k2_DBSGLK, [1024, True, 0.5, 1, True, 11]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  # Head P4: k=7
  - [-1, 2, C3k2_DBSGLK, [512, False, 0.5, 1, True, 9]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  # Head P3: k=5
  - [-1, 2, C3k2_DBSGLK, [256, False, 0.5, 1, True, 7]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  # Head P4: k=7
  - [-1, 2, C3k2_DBSGLK, [512, False, 0.5, 1, True, 9]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  # Head P5: k=9
  - [-1, 2, C3k2_DBSGLK, [1024, True, 0.5, 1, True, 11]] # 22

  - [[16, 19, 22], 1, Detect, [nc]]