# YOLO11_HSG_Extreme.yaml
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  # 建议使用 s 或 m 规模来支撑这个复杂的模块
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  # P3: 基础复杂，k=5
  - [-1, 2, C3k2_HSG, [256, False, 0.25, 1, True, 5]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  # P4: 中度复杂，k=7
  - [-1, 2, C3k2_HSG, [512, False, 0.25, 1, True, 7]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_HSG, [512, True, 0.5, 1, True, 7]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  # P5: 极度复杂，k=11，捕捉全局超大视野
  - [-1, 2, C3k2_HSG, [1024, True, 0.5, 1, True, 11]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2_HSG, [512, False, 0.5, 1, True, 7]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2_HSG, [256, False, 0.5, 1, True, 5]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2_HSG, [512, False, 0.5, 1, True, 7]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2_HSG, [1024, True, 0.5, 1, True, 11]] # 22

  - [[16, 19, 22], 1, Detect, [nc]]