# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 Backbone (使用 RepHMS 增强特征提取)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 1, RepHMS_Omni, [256, 2, 1,3]]   # 2-P2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 1, RepHMS_Omni, [512, 2, 1,5]]   # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 1, RepHMS_Omni, [512, 2, 1,7]]   # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 1, RepHMS_Omni, [1024, 2, 1,9]]  # 8-P5
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10

# BiFPN Head (C3k2 全部替换为 RepHMSPlus)
head:
  # Neck Input Adapters (统一通道为 512 以匹配 BiFPN 加权求和)
  - [2, 1, Conv, [512, 1, 1]]  # 11 P2_in
  - [4, 1, Conv, [512, 1, 1]]  # 12 P3_in
  - [6, 1, Conv, [512, 1, 1]]  # 13 P4_in
  - [10, 1, Conv, [512, 1, 1]] # 14 P5_in

  # branch3 : P5 ↔ P4
  - [13, 1, AVG, []]           # 15 P4 down
  - [[15, 14], 1, BiFPN_SumX, [2]] # 16
  - [-1, 1, RepHMS_Omni, [512, 2, 1, 7]] # 17 branch3 (取代 C3k2)

  # branch2 : P3 / P4 / P5
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [14, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [12, 1, AVG, []]           # 20
  - [[20, 13, 19, 18], 1, BiFPN_SumX, [4]] # 21
  - [-1, 1, RepHMS_Omni, [512, 2, 1,  5]] # 22 branch2 (取代 C3k2)

  # branch1 : P2 / P3 / P4
  - [22, 1, nn.Upsample, [None, 2, "nearest"]] # 23
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [11, 1, AVG, []]           # 25
  - [[25, 12, 24, 23], 1, BiFPN_SumX, [4]] # 26
  - [-1, 1, RepHMS_Omni, [512, 2, 1, 3]] # 27 branch1 (取代 C3k2)

  # Detect Heads (最终预测分支)
  - [22, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[27, 28], 1, BiFPN_SumX, [2]] # 29
  - [-1, 1, RepHMS_Omni, [512, 2, 1, 5]] # 30 P3 (取代 C3k2)

  - [30, 1, AVG, []]           # 31
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 32
  - [[31, 22, 32], 1, BiFPN_SumX, [3]] # 33
  - [-1, 1, RepHMS_Omni, [512, 2, 1,7]] # 34 P4 (取代 C3k2)

  - [34, 1, AVG, []]           # 35
  - [[35, 17], 1, BiFPN_SumX, [2]] # 36
  - [-1, 1, RepHMS_Omni, [1024, 2, 1,9]] # 37 P5 (取代 C3k2)

  - [[30, 34, 37], 1, Detect, [nc]]