# Parameters
nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone with MSDA-Star Blocks
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4

  # P3: 浅层特征，k=5，c3k=False 保持轻量
  - [-1, 2, C3k2_MSDA, [256, False, 0.25, 1, True, 5]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8

  # P4: 中层特征，k=7
  - [-1, 2, C3k2_MSDA, [512, False, 0.25, 1, True, 7]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16

  # P4-High: 增加 c3k=True 强化非线性
  - [-1, 2, C3k2_MSDA, [512, True, 0.5, 1, True, 7]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32

  # P5: 深层特征，k=9 极大感受野
  - [-1, 2, C3k2_MSDA, [1024, True, 0.5, 1, True, 9]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2_MSDA, [512, False, 0.5, 1, True, 7]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2_MSDA, [256, False, 0.5, 1, True, 5]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2_MSDA, [512, False, 0.5, 1, True, 7]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2_MSDA, [1024, True, 0.5, 1, True, 9]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)