# Parameters
nc: 80  # number of classes
scale: n  # 默认 scale 'n'（可改成 s/m/l/x）

scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone（保持你第二个模型的轻量 Ghost + Shuffle 结构）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 1, ShuffleV2Block, [256, 3, 2]] # 2-P3/8
  - [-1, 1, ShuffleV2Block, [512, 3, 2]] # 3-P4/16
  - [-1, 1, ShuffleV2Block, [1024, 3, 2]] # 4-P5/32
  - [-1, 1, ShuffleV2Block, [1024, 3, 1]] # 5
  - [-1, 1, SPPF, [1024, 5]]            # 6
  - [-1, 2, C2PSA, [1024]]              # 7 (最终 P5 特征)

# Head（移植第一个模型的 BiFPN 颈部结构，所有 C3k2 → C3RepGhost）
head:
  # ==================================================
  # Neck Input Adapters (Backbone → Neck, 统一 512)
  # ==================================================
  - [1, 1, GhostConv, [512, 1, 1]]   # 8  P2_in（来自 backbone 层1，128ch）
  - [2, 1, GhostConv, [512, 1, 1]]   # 9  P3_in（来自 backbone 层2，256ch）
  - [3, 1, GhostConv, [512, 1, 1]]   # 10 P4_in（来自 backbone 层3，512ch）
  - [7, 1, GhostConv, [512, 1, 1]]   # 11 P5_in（来自 backbone 层7，1024ch）

  # ==================================================
  # branch3 : P5 ↔ P4
  # ==================================================
  - [10, 1, AVG, []]                                      # 12 P4 ↓
  - [[12, 11], 1, BiFPN_SumX, [2]]                         # 13 BiFPN(P4↓, P5)
  - [-1, 1, C3RepGhost, [512, False, 1, 0.25]]            # 14 branch3

  # ==================================================
  # branch2 : P3 / P4 / P5
  # ==================================================
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]             # 15 branch3 ↑
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]             # 16 P5 ↑
  - [9, 1, AVG, []]                                       # 17 P3 ↓
  - [[17, 10, 16, 15], 1, BiFPN_SumX, [4]]                 # 18 BiFPN
  - [-1, 1, C3RepGhost, [512, False, 1, 0.25]]            # 19 branch2

  # ==================================================
  # branch1 : P2 / P3 / P4
  # ==================================================
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]             # 20 branch2 ↑
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]             # 21 P4 ↑
  - [8, 1, AVG, []]                                       # 22 P2 ↓
  - [[22, 9, 21, 20], 1, BiFPN_SumX, [4]]                  # 23 BiFPN
  - [-1, 1, C3RepGhost, [512, False, 1, 0.25]]            # 24 branch1

  # ---------- Detect Heads ----------
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]             # 25
  - [[24, 25], 1, BiFPN_SumX, [2]]                         # 26
  - [-1, 1, C3RepGhost, [512, True, 1, 0.5]]            # 27 P3

  - [27, 1, AVG, []]                                      # 28 P3 ↓
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]             # 29
  - [[28, 19, 29], 1, BiFPN_SumX, [3]]                     # 30
  - [-1, 1, C3RepGhost, [512, True, 1, 0.5]]            # 31 P4

  - [31, 1, AVG, []]                                      # 32 P4 ↓
  - [[32, 14], 1, BiFPN_SumX, [2]]                         # 33
  - [-1, 1, C3RepGhost, [512, True, 1, 0.5]]            # 34 P5

  - [[27, 31, 34], 1, Detect, [nc]]                        # Detect(P3, P4, P5)