# Parameters
nc: 80 # number of
scale:
  n
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # 从这里开始替换成你之前的复杂结构，但索引要对应 YOLO11 backbone
  # 关键对应：
  #   backbone 2 → 浅层 P2
  #   backbone 4 → P3
  #   backbone 6 → P4
  #   backbone 10 → P5 (C2PSA后)

  - [6, 1, AVG, []]                     # 11 对 P4 做 AVG 下采样 (假设你有 AVG 模块)
  - [[-1, 10], 1, Concat, [1]]          # 12 P4下采样 + P5
  - [-1, 1, RepHMSPlus, [512, 2, 1, 3, 9]]  # 13 branch3 RepHMS 9x9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]  # 15 P5 上采样
  - [4, 1, AVG, []]                             # 16 P3 下采样
  - [[-1, 6, -2, -3], 1, Concat, [1]]           # 17 融合 P3下采样 + P4 + 上采样P5 + 上采样branch3
  - [-1, 1, RepHMSPlus, [384, 2, 1, 3, 7]]          # 18 branch2 RepHMS 7x7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 19
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]   # 20 P4 上采样
  - [2, 1, AVG, []]                             # 21 P2 下采样
  - [[-1, 4, -2, -3], 1, Concat, [1]]           # 22 融合
  - [-1, 1, RepHMSPlus, [384, 2, 1, 3, 5]]          # 23 branch1 RepHMS 5x5

  # 继续你原来的后续融合逻辑（检测头前多次跨尺度增强）
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]  # 24 branch2 上采样
  - [[-1, -2], 1, Concat, [1]]                  # 25 branch1 + 上采样 branch2
  - [-1, 1, RepHMSPlus, [384, 2, 1, 3, 5]]          # 26 Detect head 1 (浅)

  - [-1, 1, Conv, [384, 3, 2]]                  # 27 下采样
  - [23, 1, AVG, []]                            # 28 branch1 下采样
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]  # 29 branch3 上采样
  - [[-2, -1, 18, -3], 1, Concat, [1]]          # 30
  - [-1, 1, RepHMSPlus, [384, 2, 1, 3, 7]]          # 31 Detect head 2 (中)

  - [-1, 1, Conv, [384, 3, 2]]                  # 32
  - [18, 1, AVG, []]                            # 33 branch2 下采样
  - [[-2, -1, 13], 1, Concat, [1]]              # 34
  - [-1, 1, RepHMSPlus, [512, 2, 1, 3, 9]]          # 35 Detect head 3 (深)

  - [[26, 31, 35], 1, Detect, [nc]]          # 最终检测头（如果你的框架支持 v10Detect，否则换成 D
