# Parameters
nc: 80  # number of classes

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                 # 0  P1/2 (stride 2)
  - [-1, 1, Conv, [128, 3, 2]]                # 1  P2/4 (stride 4)

  - [-1, 1, ShuffleV2Block, [256, 3, 2]]           # 2  P3/8 (stride 8)
  - [-1, 1, CoordAtt, [8]]                         # 3  CA on P3

  - [-1, 1, ShuffleV2Block, [512, 3, 2]]           # 4  P4/16 (stride 16)
  - [-1, 1, CoordAtt, [8]]                         # 5  CA on P4

  - [-1, 1, ShuffleV2Block, [1024, 3, 2]]          # 6  P5/32 (stride 32)
  - [-1, 1, CoordAtt, [8]]                         # 7  CA on P5

  - [-1, 1, ShuffleV2Block, [1024, 3, 1]]          # 8
  - [-1, 1, SPPF, [1024, 5]]                       # 9
  - [-1, 2, C2PSA_Mona, [1024]]                         # 10 final high-level PSA

head:
  # ==================================================
  # Neck Input Adapters (Backbone → Neck, 统一 512)
  # ==================================================
  - [1, 1, GhostConv, [512, 1, 1]] # 11 P2_in（来自 backbone 层1，128ch）
  - [3, 1, GhostConv, [512, 1, 1]] # 12 P3_in（来自 backbone 层3，256ch）
  - [5, 1, GhostConv, [512, 1, 1]] # 13 P4_in（来自 backbone 层5，512ch）
  - [10, 1, GhostConv, [512, 1, 1]] # 14 P5_in（来自 backbone 层10，1024ch）

  # ==================================================
  # branch3 : P5 ↔ P4
  # ==================================================
  - [13, 1, AVG, []] # 15 P4 ↓
  - [[15, 14], 1, BiFPN_SumX, [2]] # 16 BiFPN(P4↓, P5)
  - [-1, 1, C3RepGhost, [512, False, 1, 0.25]] # 17 branch3

  # ==================================================
  # branch2 : P3 / P4 / P5
  # ==================================================
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 18 branch3 ↑
  - [14, 1, nn.Upsample, [None, 2, "nearest"]] # 19 P5 ↑
  - [12, 1, AVG, []] # 20 P3 ↓
  - [[20, 13, 19, 18], 1, BiFPN_SumX, [4]] # 21 BiFPN
  - [-1, 1, C3RepGhost, [512, False, 1, 0.25]] # 22 branch2

  # ==================================================
  # branch1 : P2 / P3 / P4
  # ==================================================
  - [22, 1, nn.Upsample, [None, 2, "nearest"]] # 23 branch2 ↑
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 24 P4 ↑
  - [11, 1, AVG, []] # 25 P2 ↓
  - [[25, 12, 24, 23], 1, BiFPN_SumX, [4]] # 26 BiFPN
  - [-1, 1, C3RepGhost, [512, False, 1, 0.25]] # 27 branch1

  # ---------- Detect Heads ----------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[27, 28], 1, BiFPN_SumX, [2]] # 29
  - [-1, 1, C3RepGhost, [512, True, 1, 0.5]] # 30 P3

  - [30, 1, AVG, []] # 31 P3 ↓
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 32
  - [[31, 22, 32], 1, BiFPN_SumX, [3]] # 33
  - [-1, 1, C3RepGhost, [512, True, 1, 0.5]] # 34 P4

  - [34, 1, AVG, []] # 35 P4 ↓
  - [[35, 17], 1, BiFPN_SumX, [2]] # 36
  - [-1, 1, C3RepGhost, [512, True, 1, 0.5]] # 37 P5

  - [[30, 34, 37], 1, Detect, [nc]] # Detect(P3, P4, P5)