# Parameters
nc: 80
scale:
  n
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2_RepViTBlock, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2_RepViTBlock, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2_RepViTBlock, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2_RepViTBlock, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  # Neck Input Adapters
  - [2, 1, Conv, [512, 1, 1]]   # 11
  - [4, 1, Conv, [512, 1, 1]]   # 12
  - [6, 1, Conv, [512, 1, 1]]   # 13
  - [10, 1, Conv, [512, 1, 1]]  # 14

  # branch3 : P5 ↔ P4
  - [13, 1, AVG, []]
  - [[15, 14], 1, BiFPN_SumX, [2]]
  - [-1, 1, C3k2_RepViTBlock, [512, False, 0.25]]

  # branch2 : P3 / P4 / P5
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]
  - [12, 1, AVG, []]
  - [[20, 13, 19, 18], 1, BiFPN_SumX, [4]]
  - [-1, 1, C3k2_RepViTBlock, [512, False, 0.25]]

  # branch1 : P2 / P3 / P4
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]
  - [11, 1, AVG, []]
  - [[25, 12, 24, 23], 1, BiFPN_SumX, [4]]
  - [-1, 1, C3k2_RepViTBlock, [512, False, 0.25]]

  # Detect Heads
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[27, 28], 1, BiFPN_SumX, [2]]
  - [-1, 1, C3k2_RepViTBlock, [512, True]]   # P3

  - [30, 1, AVG, []]
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[31, 22, 32], 1, BiFPN_SumX, [3]]
  - [-1, 1, C3k2_RepViTBlock, [512, True]]   # P4

  - [34, 1, AVG, []]
  - [[35, 17], 1, BiFPN_SumX, [2]]
  - [-1, 1, C3k2_RepViTBlock, [512, True]]   # P5

  - [[30, 34, 37], 1, Detect, [nc]]
