# Ultralytics YOLO11 object detection model with CoordAtt integration
nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]

# YOLO11 backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, ShuffleV2Block, [256, 3, 2]] # 2-P3/8
  - [-1, 1, ShuffleV2Block, [512, 3, 2]] # 3-P4/16
  - [-1, 1, ShuffleV2Block, [1024, 3, 2]] # 4-P5/32
  - [-1, 1, ShuffleV2Block, [1024, 3, 1]] # 5
  - [-1, 1, SPPF, [1024, 5]] # 6
  - [-1, 2, C2PSA, [1024]] # 7

# YOLO11 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 8
  - [[-1, 3], 1, Concat, [1]] # 9 cat backbone P4
  - [-1, 2, C3RepGhost, [512, False, 1, 0.25]] # 10 (P4 feature)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 2], 1, Concat, [1]] # 12 cat backbone P3
  - [-1, 2, C3RepGhost, [256, False, 1, 0.25]] # 13 (P3 feature)

  - [-1, 1, Conv, [256, 3, 2]] # 14
  - [[-1, 10], 1, Concat, [1]] # 15 cat head P4
  - [-1, 2, C3RepGhost, [512, False, 1, 0.25]] # 16 (P4 feature)

  - [-1, 1, Conv, [512, 3, 2]] # 17
  - [[-1, 7], 1, Concat, [1]] # 18 cat head P5
  - [-1, 2, C3RepGhost, [1024, True, 1, 0.25]] # 19 (P5 feature)

  # --- 添加 EMA_attention 层 ---
  - [13, 1, EMA_attention, [256]] # 20: 作用于 P3 (来自第13层)
  - [16, 1, EMA_attention, [512]] # 21: 作用于 P4 (来自第16层)
  - [19, 1, EMA_attention, [1024]] # 22: 作用于 P5 (来自第19层)

  # 修改 Detect 的输入，使用经过 CoordAtt 处理后的索引 [20, 21, 22]
  - [[20, 21,22], 1, Detect, [nc]] # 23: Detect(P3, P4, P5)