# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of
scale:
  n
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
# YOLO11-Light Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C2faster, [256, True]] # 2-P3/8 (由原来的 P3 提取调整而来)

  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8 降采样
  - [-1, 2, C2faster, [512, True]] # 4-P3/8 特征提取 (替换 C3Ghost)

  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C2faster, [512, True]] # 6-P4/16 (替换 C3Ghost)

  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C2faster, [1024, True]]# 8-P5/32 (替换 C3Ghost)

  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10 (保留 PSA 增强全局建模能力)
# YOLO11-Light Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 2, C2faster, [512, False]] # 13 (替换 C3k2, 浅层不使用 shortcut)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 2, C2faster, [256, False]] # 16 (P3/8-small, 替换 C3k2)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18 cat head P4
  - [-1, 2, C2faster, [512, True]] # 19 (P4/16-medium, 替换 C3k2, 开启 shortcut)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21 cat head P5
  - [-1, 2, C2faster, [1024, True]] # 22 (P5/32-large, 替换 C3k2, 开启 shortcut)

  - [[16, 19, 22], 1, Detect, [nc]] # 23: Detect(P3, P4, P5)
