# YOLO11n-v2 (RepHMS_Pro 对标第一个模型配置版本)
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]  # 还原回第一个模型的 0.50 深度倍率
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, RepHMS_Pro, [128, 2, 1, 3]] # 2: [c2, width, depth, kersize] 对标第一个模型的 [128, 2, 1, 3, 3]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, RepHMS_Pro, [256, 3, 1, 3]] # 4: 对标 [256, 3, 1, 3, 5]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 1, RepHMS_Pro, [512, 3, 1, 3]] # 6: 对标 [512, 3, 1, 3, 7]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, RepHMS_Pro, [1024, 2, 1, 3]] # 8: 对标 [1024, 2, 1, 3, 9]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 1, RepHMS_Pro, [512, 2, 1, 3]] # 13 对标 [512, 2, 1, 3, 7]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 1, RepHMS_Pro, [256, 2, 1, 3]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18 cat head P4
  - [-1, 1, RepHMS_Pro, [512, 2, 1, 3]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21 cat head P5
  - [-1, 1, RepHMS_Pro, [1024, 2, 1, 3]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)