# Parameters
nc: 80  # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.75, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n-v2 backbone + head (RepDGM_V2)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]               # 1-P2/4
  - [-1, 1, RepDGM_V2, [128, 3, 1, 5]]        # 2

  - [-1, 1, Conv, [256, 3, 2]]               # 3-P3/8
  - [-1, 1, RepDGM_V2, [256, 3, 1, 7]]        # 4

  - [-1, 1, Conv, [512, 3, 2]]               # 5-P4/16
  - [-1, 1, RepDGM_V2, [512, 3, 1, 9]]        # 6

  - [-1, 1, Conv, [1024, 3, 2]]              # 7-P5/32
  - [-1, 1, RepDGM_V2, [1024, 3, 1, 11]]      # 8

  - [-1, 1, SPPF, [1024, 5]]                  # 9
  - [-1, 2, C2PSA, [1024]]                    # 10
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]# 11
  - [[-1, 6], 1, Concat, [1]]                 # 12
  - [-1, 1, RepDGM_V2, [512, 3, 1, 9]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]# 14
  - [[-1, 4], 1, Concat, [1]]                 # 15
  - [-1, 1, RepDGM_V2, [256, 3, 1, 7]]         # 16

  - [-1, 1, Conv, [256, 3, 2]]                # 17
  - [[-1, 13], 1, Concat, [1]]                # 18
  - [-1, 1, RepDGM_V2, [512, 3, 1, 9]]         # 19

  - [-1, 1, Conv, [512, 3, 2]]                # 20
  - [[-1, 10], 1, Concat, [1]]                # 21
  - [-1, 1, RepDGM_V2, [1024, 3, 1, 11]]       # 22

  - [[16, 19, 22], 1, Detect, [nc]]            # 23 Detect(P3, P4, P5)
