# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.75, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------- Backbone ----------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]                    # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1 P2/4
  - [-1, 1, RepSFA, [128, 3, 1, 5, 0.5]]          # 2  P2  k=5

  - [-1, 1, Conv, [256, 3, 2]]                   # 3  P3/8
  - [-1, 1, RepSFA, [256, 3, 1, 7, 0.5]]          # 4  P3  k=7

  - [-1, 1, Conv, [512, 3, 2]]                   # 5  P4/16
  - [-1, 1, RepSFA, [512, 3, 1, 9, 0.5]]          # 6  P4  k=9

  - [-1, 1, Conv, [1024, 3, 2]]                  # 7  P5/32
  - [-1, 1, RepSFA, [1024, 3, 1, 11, 0.5]]        # 8  P5  k=11

  - [-1, 1, SPPF, [1024, 5]]                     # 9
  - [-1, 2, C2PSA, [1024]]                       # 10

# ---------------- Head ----------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]                    # P4
  - [-1, 1, RepSFA, [512, 3, 1, 9, 0.5]]          # 13  P4 head k=9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                    # P3
  - [-1, 1, RepSFA, [256, 3, 1, 7, 0.5]]          # 16  P3 head k=7

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]                   # P4
  - [-1, 1, RepSFA, [512, 3, 1, 9, 0.5]]          # 19  P4 head k=9

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]                   # P5
  - [-1, 1, RepSFA, [1024, 3, 1, 11, 0.5]]        # 22  P5 head k=11

  - [[16, 19, 22], 1, Detect, [nc]]
