# This config replaces all RepHMS blocks with the enhanced RepHMSPlus (mixed UniRepLKNet + ShiftwiseConv,
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-plus.yaml' will call yolo11-plus.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # summary: ~319 layers, ~2.8M parameters (estimated, +5-10% vs original due to gates)
  s: [0.50, 0.50, 1024]  # summary: ~319 layers, ~10M parameters
  m: [0.50, 1.00, 512]   # summary: ~409 layers, ~22M parameters
  l: [1.00, 1.00, 512]   # summary: ~631 layers, ~28M parameters
  x: [1.00, 1.50, 512]   # summary: ~631 layers, ~62M parameters

# YOLO11n-plus backbone (RepHMS → RepHMSPlus)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 1, RepHMSPlus, [128, 2, 1, 3, 3]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 1, RepHMSPlus, [256, 3, 1, 3, 5]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 1, RepHMSPlus, [512, 3, 1, 3, 7]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 1, RepHMSPlus, [1024, 2, 1, 3, 9]]  # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10

# YOLO11n-plus head (RepHMS → RepHMSPlus)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # cat backbone P4
  - [-1, 1, RepHMSPlus, [512, 2, 1, 3, 7]]   # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # cat backbone P3
  - [-1, 1, RepHMSPlus, [256, 2, 1, 3, 5]]   # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # cat head P4
  - [-1, 1, RepHMSPlus, [512, 2, 1, 3, 7]]   # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]     # cat head P5
  - [-1, 1, RepHMSPlus, [1024, 2, 1, 3, 9]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)