# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs + ASFF fusion
# 修改说明：删除了 Bottom-up Pathway（自底向上路径），直接在 Top-down 后使用 ASFF 融合
# 优点：模型更轻，计算量减少；缺点：可能对大物体定位稍弱，但 ASFF 自适应融合能部分弥补
# 额外修改：将 nn.Upsample 替换为 DySample（动态采样），引入可学习偏移上采样

# Parameters
nc: 80  # number of classes
scale: n
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone（主干网络，提取多尺度特征）——保持不变
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]]  # 10

# Head（颈部 + 检测头）——只保留 Top-down Pathway + ASFF，替换上采样为 DySample
head:
  # ────────────────────────────────
  # Top-down Pathway（自顶向下路径）——保留，用于注入语义信息到高分辨率特征
  # ────────────────────────────────
  - [-1, 1, DySample, [None, 2, 'lp', 4, False]]  # 11: 从 P5 上采样 (替换 nn.Upsample；None 为占位，实际in_channels自动推断)
  - [[-1, 6], 1, Concat, [1]]  # Concat 上采样 P5 + Backbone P4 (层6)
  - [-1, 2, C3k2, [512, False]]  # 13: 融合 P4

  - [-1, 1, DySample, [None, 2, 'lp', 4, False]]  # 14: 上采样到 P3 大小 (替换 nn.Upsample)
  - [[-1, 4], 1, Concat, [1]]  # Concat 上采样 + Backbone P3 (层4)
  - [-1, 2, C3k2, [256, False]]  # 16: 融合后的 P3（小尺度）

  # 此时我们有：
  # - 层16: P3 (256ch → scale n 下为64ch) @ 80×80 或 32×32（取决于输入尺寸）
  # - 层13: P4 (512ch → scale n 下为128ch) @ 40×40 或 16×16
  # - 层10: P5 (1024ch → scale n 下为256ch) @ 20×20 或 8×8

  # ────────────────────────────────
  # 直接使用 ASFF 融合三个尺度的原始/Top-down 特征
  # 输入顺序：[小尺度(P3=16), 中尺度(P4=13), 大尺度(P5=10)]
  # ────────────────────────────────
  - [[16, 13, 10], 1, ASFF, [2, 0.25]]  # 17: ASFF level=2 → 融合小尺度输出（64ch @ P3分辨率）
  - [[16, 13, 10], 1, ASFF, [1, 0.25]]  # 18: ASFF level=1 → 融合中尺度输出（128ch @ P4分辨率）
  - [[16, 13, 10], 1, ASFF, [0, 0.25]]  # 19: ASFF level=0 → 融合大尺度输出（256ch @ P5分辨率）

  # ────────────────────────────────
  # 检测头：使用 ASFF 融合后的三个特征
  # 强烈建议显式指定通道，避免初始化错误
  # ────────────────────────────────
  - [[17, 18, 19], 1, Detect, [nc]]  # Detect(fused P3, fused P4, fused P5)

  # 如果你的 ASFF 已经修改为支持自定义输出通道，也可以写成：
  # - [[16, 13, 10], 1, ASFF, [2, 64]] # level=2, out_channels=64
  # - [[16, 13, 10], 1, ASFF, [1, 128]]
  # - [[16, 13, 10], 1, ASFF, [0, 256]]
  # - [[-3, -2, -1], 1, Detect, [nc]]