# Parameters
nc: 80  # number of classes
scale:
  n

scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # YOLOv11n scale
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n-mamba backbone (所有 C3k2 → C3k2Mamba)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2Mamba, [256, False, 0.25, 0.5, 0.25, 7, 2.0, 0.1]]  # P3: 浅层高 global_ratio + 大核
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2Mamba, [512, False, 0.25, 0.4, 0.25, 5, 2.0, 0.1]]   # P4: 中等 global
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2Mamba, [512, True, 0.5, 0.3, 0.25, 5, 2.0, 0.1]]    # P5: 深层低 global
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2Mamba, [1024, True, 0.5, 0.25, 0.25, 3, 2.0, 0.1]]  # 最深层最小核 + 最低 global
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]]  # 10

# YOLO11n-mamba head (所有 C3k2 → C3k2Mamba)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2Mamba, [512, False, 0.5, 0.4, 0.25, 5, 2.0, 0.1]]  # 上采样后中等 global

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2Mamba, [256, False, 0.25, 0.6, 0.25, 7, 2.0, 0.1]]  # 小特征图：高 global + 大核

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2Mamba, [512, False, 0.5, 0.4, 0.25, 5, 2.0, 0.1]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2Mamba, [1024, True, 0.5, 0.3, 0.25, 3, 2.0, 0.1]]

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)