# Ultralytics 🚀 AGPL-3.0 License

# Parameters
nc: 80
scale:
  n
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# YOLO11n Backbone (不动)
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]           # 5  P4/16
  - [-1, 2, C3k2, [512, True]]           # 6
  - [-1, 1, Conv, [1024, 3, 2]]          # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10

head:
  # 1. 预对齐（P3 / P4 / P5）
  - [3, 1, Conv, [256, 1, 1]]              # 11  P3_in
  - [5, 1, Conv, [512, 1, 1]]              # 12  P4_in
  - [10, 1, Conv, [1024, 1, 1]]            # 13  P5_in

  # 2. Top-down Path
  # P5 -> P4
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [-1, 1, Conv, [512, 1, 1]]                 # 15
  - [[-1, 12], 1, BiFPN_Sum2, [1]]              # 16
  - [-1, 2, C3k2, [512, False]]                 # 17  P4_td

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [-1, 1, Conv, [256, 1, 1]]                  # 19
  - [[-1, 11], 1, BiFPN_Sum2, [1]]               # 20
  - [-1, 2, C3k2, [256, False]]                  # 21  P3_out

  # 3. Bottom-up Path
  # P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 12, 17], 1, BiFPN_Sum3, [1]]            # 23
  - [-1, 2, C3k2, [512, False]]                  # 24  P4_out

  # P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]]                  # 25
  - [[-1, 13], 1, BiFPN_Sum2, [1]]               # 26
  - [-1, 2, C3k2, [1024, True]]                  # 27  P5_out

  # Detect
  - [[21, 24, 27], 1, Detect, [nc]]              # 28
