# Parameters
nc: 80
scale:
  n
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# YOLO11n Backbone（全换）
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]                     # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]                    # 1 P2/4
  - [-1, 2, C3RepGhost, [256, False, 2, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]                    # 3 P3/8
  - [-1, 2, C3RepGhost, [512, False, 2, 0.25]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]                    # 5 P4/16
  - [-1, 2, C3RepGhost, [512, True, 2, 0.25]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]                   # 7 P5/32
  - [-1, 2, C3RepGhost, [1024, True, 2, 0.25]]    # 8
  - [-1, 1, SPPF, [1024, 5]]                      # 9
  - [-1, 2, C2PSA, [1024]]                        # 10

# =========================
# YOLO11n Head（全换）
# =========================
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]                     # cat backbone P4
  - [-1, 2, C3RepGhost, [512, False, 2, 0.25]]    # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                     # cat backbone P3
  - [-1, 2, C3RepGhost, [256, False, 2, 0.25]]    # 16 P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]                    # cat head P4
  - [-1, 2, C3RepGhost, [512, False, 2, 0.25]]    # 19 P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]                    # cat head P5
  - [-1, 2, C3RepGhost, [1024, True, 2, 0.25]]    # 22 P5/32

  - [[16, 19, 22], 1, Detect, [nc]]
