# Parameters
nc: 80 # number of
scale:
  m
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 2048] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
# 1. YOLO11 Backbone (最后层索引为 10)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 (这是骨架 P5 的最终输出)

# YOLO11n Gold-YOLO Neck (migrated, structure unchanged)
head:
  # =====================
  # Low-GD
  # =====================
  # use conv fusion global info
  - [[2, 4, 6, -1], 1, Low_FAM, []]                # 11
  - [-1, 1, Low_IFM, [768, 96, 3]]                  # 12
  - [-1, 1, Split, [512, 256]]                      # 13

  # inject low-level global info to P4
  - [10, 1, SimConv, [512, 1, 1]]                   # 14 (P5_half)
  - [[4, 6, -1], 1, Low_LAF, [256]]                # 15
  - [[-1, 13], 1, Inject, [512, 0, 'SyncBN']]       # 16
  - [-1, 1, RepBlock, [512, 4]]                     # 17 (P4)

  # inject low-level global info to P3
  - [-1, 1, SimConv, [256, 1, 1]]                   # 18 (P4_half)
  - [[1, 4, -1], 1, Low_LAF, [128]]                 # 19
  - [[-1, 13], 1, Inject, [256, 1, 'SyncBN']]       # 20
  - [-1, 1, RepBlock, [256, 4]]                     # 21 (P3)

  # =====================
  # High-GD
  # =====================
  # use transformer fusion global info
  - [[-1, 17, 10], 1, High_FAM, [2, 'torch']]       # 22
  - [-1, 1, High_IFM,[2, 448, 8, 4, 1, 2, 0, 0, 0.1, 2, 'SyncBN']]  # 23
  - [-1, 1, Conv, [1536, 1, 1]]                     # 24
  - [-1, 1, Split, [512, 1024]]                     # 25

  # inject global info to N4
  - [[21, 18], 1, High_LAF, []]                     # 26
  - [[-1, 25], 1, Inject, [512, 0, 'SyncBN']]       # 27
  - [-1, 1, RepBlock, [512, 4]]                     # 28 (N4)

  # inject global info to N5
  - [[-1, 14], 1, High_LAF, []]                     # 29
  - [[-1, 25], 1, Inject, [1024, 1, 'SyncBN']]      # 30
  - [-1, 1, RepBlock, [1024, 4]]                    # 31 (N5)

  # Detect
  - [[21, 28, 31], 1, Detect, [nc]]                 # 32 Detect(P3, P4, P5)
