# Parameters
nc: 80 # number of
scale:
  n
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Slim-neck by GSConv (替换原 head 为这个结构，索引从 -1 开始接 backbone 的 10)
head:
  - [-1, 1, GSConv, [512, 1, 1]]          # 11: 1x1 GSConv 压缩 1024→512
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12: 上采样到 P4 尺度
  - [[-1, 6], 1, Concat, [1]]             # 13: cat backbone P4 (层6 输出 512ch)
  - [-1, 1, VoVGSCSP, [512, False]]       # 14: 输出 512ch (P4 融合)

  - [-1, 1, GSConv, [256, 1, 1]]          # 15: 继续压缩到 256
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16: 上采样到 P3 尺度
  - [[-1, 4], 1, Concat, [1]]             # 17: cat backbone P3 (层4 输出 256ch)
  - [-1, 1, VoVGSCSP, [256, False]]       # 18: P3/8 small 输出 256ch ← 对应原 16

  - [-1, 1, GSConv, [256, 3, 2]]          # 19: 3x3 GSConv 下采样回 P4
  - [[-1, 14], 1, Concat, [1]]            # 20: cat 刚才的 P4 路径 (层14 输出 512ch? 等下注意通道)
  - [-1, 1, VoVGSCSP, [512, False]]       # 21: P4/16 medium 输出 512ch ← 对应原 19

  - [-1, 1, GSConv, [512, 3, 2]]          # 22: 下采样到 P5
  - [[-1, 11], 1, Concat, [1]]            # 23: cat 最早的 512ch 路径 (层11 输出 512ch)
  - [-1, 1, VoVGSCSP, [1024, False]]      # 24: P5/32 large 输出 1024ch ← 对应原 22

  - [[18, 21, 24], 1, Detect, [nc]]       # Detect(P3, P4, P5) ← 关键：用新的输出层索引 18/21/24
